Hi,
thanks for your response.
yes, I still see this issue.
Certificate and keys are imported correct.
please, which version of f5 bigip, terraform nad provider did you test?

I repeat my configuration only for profile client ssl.

```
resource "bigip_ltm_profile_client_ssl" "profile_client_ssl" {
  name          = "/Common/temp_lbeform.intra.dcom.sk"
  #partition     = "Common"
  #defaults_from = "/Common/clientssl-STRENGTH-v3"
  cert          = "/Common/grafana.intra.dcom.sk_2018_INT.crt"
  key           = "/Common/grafana.intra.dcom.sk_2018_INT.key"
}
```

Output of terraform apply & terraform show

```
$ tf123 apply
bigip_ltm_profile_client_ssl.profile_client_ssl: Refreshing state... [id=/Common/temp_lbeform.intra.dcom.sk]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_profile_client_ssl.profile_client_ssl will be created
  + resource "bigip_ltm_profile_client_ssl" "profile_client_ssl" {
      + alert_timeout                       = (known after apply)
      + allow_non_ssl                       = (known after apply)
      + authenticate                        = (known after apply)
      + authenticate_depth                  = (known after apply)
      + ca_file                             = (known after apply)
      + cache_size                          = (known after apply)
      + cache_timeout                       = (known after apply)
      + cert                                = "/Common/grafana.intra.dcom.sk_2018_INT.crt"
      + cert_extension_includes             = (known after apply)
      + cert_life_span                      = (known after apply)
      + cert_lookup_by_ipaddr_port          = (known after apply)
      + chain                               = (known after apply)
      + ciphers                             = (known after apply)
      + client_cert_ca                      = (known after apply)
      + crl_file                            = (known after apply)
      + defaults_from                       = (known after apply)
      + forward_proxy_bypass_default_action = (known after apply)
      + generic_alert                       = (known after apply)
      + handshake_timeout                   = (known after apply)
      + id                                  = (known after apply)
      + inherit_cert_keychain               = (known after apply)
      + key                                 = "/Common/grafana.intra.dcom.sk_2018_INT.key"
      + mod_ssl_methods                     = (known after apply)
      + mode                                = (known after apply)
      + name                                = "/Common/temp_lbeform.intra.dcom.sk"
      + passphrase                          = (known after apply)
      + peer_cert_mode                      = (known after apply)
      + proxy_ca_cert                       = (known after apply)
      + proxy_ca_key                        = (known after apply)
      + proxy_ca_passphrase                 = (known after apply)
      + proxy_ssl                           = (known after apply)
      + proxy_ssl_passthrough               = (known after apply)
      + renegotiate_period                  = (known after apply)
      + renegotiate_size                    = (known after apply)
      + renegotiation                       = (known after apply)
      + retain_certificate                  = (known after apply)
      + secure_renegotiation                = (known after apply)
      + server_name                         = (known after apply)
      + session_mirroring                   = (known after apply)
      + session_ticket                      = (known after apply)
      + sni_default                         = (known after apply)
      + sni_require                         = (known after apply)
      + ssl_forward_proxy                   = (known after apply)
      + ssl_forward_proxy_bypass            = (known after apply)
      + ssl_sign_hash                       = (known after apply)
      + strict_resume                       = (known after apply)
      + tm_options                          = (known after apply)
      + unclean_shutdown                    = (known after apply)

      + cert_key_chain {
          + cert       = (known after apply)
          + chain      = (known after apply)
          + key        = (known after apply)
          + name       = (known after apply)
          + passphrase = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_profile_client_ssl.profile_client_ssl: Creating...

Error: json: cannot unmarshal string into Go struct field ClientSSLProfile.tmOptions of type []string

  on lb_config.tf line 64, in resource "bigip_ltm_profile_client_ssl" "profile_client_ssl":
  64: resource "bigip_ltm_profile_client_ssl" "profile_client_ssl" {
```


```
$ tf123 show
# bigip_ltm_profile_client_ssl.profile_client_ssl: (tainted)
resource "bigip_ltm_profile_client_ssl" "profile_client_ssl" {
    cert                    = "/Common/grafana.intra.dcom.sk_2018_INT.crt"
    cert_extension_includes = []
    id                      = "/Common/temp_lbeform.intra.dcom.sk"        
    key                     = "/Common/grafana.intra.dcom.sk_2018_INT.key"
    name                    = "/Common/temp_lbeform.intra.dcom.sk"        
    tm_options              = []
}
```
